tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "sanemat/font"

brew "argocd"
brew "autoconf"
brew "automake"
brew "asdf"
brew "bat"
brew "bash"
brew "cmake"
brew "libtool"
brew "fontconfig"
brew "harfbuzz"
brew "pango"
brew "gh"
brew "gnutls"
brew "go"
brew "glances"
brew "helm"
brew "jq"
brew "kustomize"
brew "libfido2"
brew "libvterm"
brew "lima"
brew "mas"
brew "mysql"
brew "opentofu"
brew "peco"
brew "pipx"
brew "postgresql@14"
brew "pyright"
brew "pkg-config"
brew "poetry"
brew "qemu"
brew "rsync"
brew "tcl-tk"
brew "skaffold"
brew "starship"
brew "sqlite3"
brew "tmux"
brew "tig"
brew "tree"
brew "wget"
brew "font-hackgen-nerd"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "emacs"
cask "font-hack-nerd-font"
cask "chromium"
cask "google-cloud-sdk"
cask "google-chrome"
cask "kitty"
cask "orbstack"
cask "raycast"
cask "dbeaver-community"
cask "karabiner-elements"
cask "meetingbar"
cask "aquaskk"
