tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "sanemat/font"
tap "homebrew/cask-fonts"
tap "spring-io/tap"

brew "argocd"
brew "autoconf"
brew "automake"
brew "asdf"
brew "bat"
brew "bash"
brew "cmake"
brew "libtool"
brew "fontconfig"
brew "harfbuzz"
brew "pango"
brew "gh"
brew "gnutls"
brew "go"
brew "glances"
brew "helm"
brew "jq"
brew "kustomize"
brew "libfido2"
brew "libvterm"
brew "lima"
brew "lua"
brew "imagemagick"
brew "mas"
brew "mysql"
brew "opentofu"
brew "peco"
brew "pipx"
brew "postgresql@14"
brew "pyright"
brew "pkg-config"
brew "poetry"
brew "qemu"
brew "rsync"
brew "tcl-tk"
brew "skaffold"
brew "starship"
brew "sqlite3"
brew "tmux"
brew "tig"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "ricty"
brew "minikube"
brew "kubernetes-cli"
brew "maven"
brew "spring-boot"
brew "neovim"
brew "lazygit"
brew "nodebrew"
brew "pwgen"
brew "lua"
brew "pnpm"
brew "hashicorp/tap/terraform-ls"
brew "uv"

cask "chromium"
cask "google-cloud-sdk"
cask "google-chrome"
cask "kitty"
cask "orbstack"
cask "raycast"
cask "dbeaver-community"
cask "karabiner-elements"
cask "meetingbar"
cask "aquaskk"
cask "iterm2"
cask "font-hackgen-nerd"
cask "slack"
cask "discord"
cask "cursor"
cask "wezterm@nightly"
cask "obsidian"
cask "dbeaver-community"
cask "hammerspoon"
cask "claude-code"

tap "d12frosted/emacs-plus"
tap "railwaycat/emacsmacport"
brew "emacs-plus@31"
cask "emacs-plus-app@master"
