# 外部 tap は Homebrew 4.5 以降 `brew trust` による明示的な信頼が必要。
# `brew bundle --global` を直接叩いてもエラーにならないよう、ここで自動 trust する。
# `brew bundle` 実行中の subshell には PATH が通っていないため、HOMEBREW_BREW_FILE を使う。
_brew = ENV["HOMEBREW_BREW_FILE"] || "brew"
%w[
  koekeishiya/formulae
  laishulu/homebrew
  spring-io/tap
  hashicorp/tap
  d12frosted/emacs-plus
  railwaycat/emacsmacport
].each { |t| system(_brew, "trust", "--tap", t, out: File::NULL, err: File::NULL) }

tap "koekeishiya/formulae"
tap "laishulu/homebrew"
tap "spring-io/tap"
tap "d12frosted/emacs-plus"
tap "railwaycat/emacsmacport"

brew "argocd"
brew "autoconf"
brew "automake"
brew "bat"
brew "bash"
brew "cmake"
brew "libtool"
brew "fontconfig"
brew "harfbuzz"
brew "pango"
brew "gh"
brew "gnutls"
brew "go"
brew "glances"
brew "helm"
brew "jq"
brew "kustomize"
brew "libfido2"
brew "libvterm"
brew "lima"
brew "lua"
brew "imagemagick"
brew "ghostscript"
brew "mas"
brew "mysql"
brew "opentofu"
brew "peco"
brew "pipx"
brew "postgresql@14"
brew "pkg-config"
brew "poetry"
brew "qemu"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "zoxide"
brew "eza"
brew "git-delta"
brew "direnv"
brew "rsync"
brew "tcl-tk"
brew "skaffold"
brew "sqlite3"
brew "tmux"
brew "tig"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "laishulu/homebrew/macism"
brew "minikube"
brew "kubernetes-cli"
brew "maven"
brew "spring-boot"
brew "neovim"
brew "lazygit"
brew "pwgen"
brew "pnpm"
brew "hashicorp/tap/terraform-ls"
brew "uv"
brew "zellij"
brew "cmigemo"
brew "mise"
brew "aqua"
brew "devcontainer"
brew "pngpaste"
brew "pandoc"
brew "gnupg"
brew "pinentry-mac"

cask "1password-cli"
cask "chromium"
cask "gcloud-cli"
cask "google-chrome"
cask "kitty"
cask "raycast"
cask "dbeaver-community"
cask "karabiner-elements"
cask "meetingbar"
cask "aquaskk"
cask "font-fira-code"
cask "font-hackgen-nerd"
cask "font-monaspace-nf"
cask "slack"
cask "discord"
cask "cursor"
cask "obsidian"
cask "hammerspoon"
cask "claude-code"
cask "claude"
cask "kindle-previewer"
cask "basictex"
cask "font-symbols-only-nerd-font"
cask "emacs-plus-app@master"
